Exrecice 1

In [4]:
import pandas as pd
import numpy as np

keys = ['a', 'b', 'c']
values = [100, 200, 300]

pd.Series(data=values, index=keys)

a    100
b    200
c    300
dtype: int64

Exercice 2:

In [16]:
a = np.arange(1,10).reshape(3,3)
df  = pd.DataFrame(a, columns=keys)
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [17]:
df['a']

0    1
1    4
2    7
Name: a, dtype: int64

In [19]:
df['d'] = [10,11,12]
df

   a  b  c   d
0  1  2  3  10
1  4  5  6  11
2  7  8  9  12

In [22]:
df = df.drop('b', axis=1)
df

   a  c   d
0  1  3  10
1  4  6  11
2  7  9  12

Exercice 3:

In [27]:
df  = pd.DataFrame(a, columns=keys)
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [30]:
print(df[['a','c']])
print(df.loc[1])

   a  c
0  1  3
1  4  6
2  7  9
a    4
b    5
c    6
Name: 1, dtype: int64

Exercice 4:

In [31]:
df['sum'] = np.sum(df, axis=1)
df

   a  b  c  sum
0  1  2  3    6
1  4  5  6   15
2  7  8  9   24

In [34]:
df = df.drop('sum', axis=1)
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [37]:
df['random'] = np.random.randint(0, 11, 3)
df

   a  b  c  random
0  1  2  3       0
1  4  5  6       9
2  7  8  9       9

Exerciec 5:

In [43]:
left = pd.DataFrame({
    'key': [1,2,3],
    'A': ['A1', 'A2', 'A3'],
    'B': ['B1', 'B2', 'B3'],
}, index=[0, 1, 2])
right = pd.DataFrame({
    'key': [1,2,3],
    'C': ['C1', 'C2', 'C3'],
    'D': ['D1', 'D2', 'D3'],
}, index=[0, 1, 2])
left, right

(   key   A   B
 0    1  A1  B1
 1    2  A2  B2
 2    3  A3  B3,
    key   C   D
 0    1  C1  D1
 1    2  C2  D2
 2    3  C3  D3)

In [44]:
pd.merge(left, right,how='inner', on='key')

   key   A   B   C   D
0    1  A1  B1  C1  D1
1    2  A2  B2  C2  D2
2    3  A3  B3  C3  D3

In [45]:
pd.merge(left, right,how='outer', on='key')

   key   A   B   C   D
0    1  A1  B1  C1  D1
1    2  A2  B2  C2  D2
2    3  A3  B3  C3  D3

In [46]:
right['E'] = ['E1','E2','E3']
right

   key   C   D   E
0    1  C1  D1  E1
1    2  C2  D2  E2
2    3  C3  D3  E3

In [47]:
pd.merge(left, right,how='outer', on='key')

   key   A   B   C   D   E
0    1  A1  B1  C1  D1  E1
1    2  A2  B2  C2  D2  E2
2    3  A3  B3  C3  D3  E3

Exercice 6:

In [56]:
a = [[1.0,np.nan, 3.0],
     [np.nan,5.0, 6.0],
     [7.0,8.0, np.nan]]
df  = pd.DataFrame(a, columns=keys)
df

     a    b    c
0  1.0  NaN  3.0
1  NaN  5.0  6.0
2  7.0  8.0  NaN

In [57]:
df.fillna(value=0)

     a    b    c
0  1.0  0.0  3.0
1  0.0  5.0  6.0
2  7.0  8.0  0.0

In [59]:
a = [[1.0,np.nan, 3.0],
     [np.nan,5.0, 6.0],
     [7.0,8.0, np.nan]]
df  = pd.DataFrame(a, columns=keys)
df
df.fillna(value=df.mean(), inplace=True)
df

     a    b    c
0  1.0  6.5  3.0
1  4.0  5.0  6.0
2  7.0  8.0  4.5

In [60]:
a = [[1.0,np.nan, 3.0],
     [np.nan,5.0, 6.0],
     [7.0,8.0, np.nan]]
df  = pd.DataFrame(a, columns=keys)
df.dropna()

Empty DataFrame
Columns: [a, b, c]
Index: []

Exercice 7:

In [65]:
a = [['A',1],
     ['B',2],
     ['A',3],
     ['B',4],
     ['A',5],
     ['B',6]]
df = pd.DataFrame(a, columns=['Category', 'Value'])
df

  Category  Value
0        A      1
1        B      2
2        A      3
3        B      4
4        A      5
5        B      6

In [67]:
df.groupby('Category').mean()

          Value
Category
A           3.0
B           4.0

In [68]:
df.groupby('Category').sum()

          Value
Category
A             9
B            12

In [69]:
df.groupby('Category').count()

          Value
Category
A             3
B             3

Exercice 8:

In [72]:
a = [['A','X', 1],
    ['A','Y', 2],
    ['A','X', 3],
    ['B','Y', 4],
    ['B','X', 5],
    ['B','Y', 6]]
pivot = pd.DataFrame(a, columns=['Category','Type', 'Value'])
pivot

  Category Type  Value
0        A    X      1
1        A    Y      2
2        A    X      3
3        B    Y      4
4        B    X      5
5        B    Y      6

In [ ]:
pivot_mean = pd.pivot_table(pivot, values='Value', index='Category', columns='Type', aggfunc='mean')
print(pivot_mean)

Type        X    Y
Category
A         2.0  2.0
B         5.0  5.0

In [ ]:
pivot_sum = pd.pivot_table(pivot, values='Value', index='Category', columns='Type', aggfunc='sum')
print(pivot_sum)

Type      X   Y
Category
A         4   2
B         5  10

In [93]:
pivot_with_margins = pd.pivot_table(pivot, values='Value', index='Category', columns='Type', aggfunc='mean', margins=True)
print(pivot_with_margins)

Type        X    Y  All
Category
A         2.0  2.0  2.0
B         5.0  5.0  5.0
All       3.0  4.0  3.5

Exercice 9:

In [95]:
date_range = pd.date_range(start='2023-01-01', periods=6, freq='D')

values = np.random.randint(1, 100, size=6)

df = pd.DataFrame({'Date': date_range, 'Value': values})
df

        Date  Value
0 2023-01-01     14
1 2023-01-02     46
2 2023-01-03     13
3 2023-01-04     71
4 2023-01-05     11
5 2023-01-06     22

In [96]:
df.set_index('Date', inplace=True)
df

            Value
Date
2023-01-01     14
2023-01-02     46
2023-01-03     13
2023-01-04     71
2023-01-05     11
2023-01-06     22

In [97]:
df_resampled = df.resample('2D').sum()
df_resampled

            Value
Date
2023-01-01     60
2023-01-03     84
2023-01-05     33

Exercice 10:

In [99]:
data = {
    'A': [1.0, 2.0, np.nan],
    'B': [np.nan, 5.0, 8.0],
    'C': [3.0, np.nan, 9.0]
}

df = pd.DataFrame(data)
df

     A    B    C
0  1.0  NaN  3.0
1  2.0  5.0  NaN
2  NaN  8.0  9.0

In [101]:
df_interpolated = df.interpolate()
df_interpolated

     A    B    C
0  1.0  NaN  3.0
1  2.0  5.0  6.0
2  2.0  8.0  9.0

In [102]:
df_dropped = df.dropna()
df_dropped

Empty DataFrame
Columns: [A, B, C]
Index: []

Exercice 11:

In [103]:
a = np.arange(1,10).reshape(3,3)
df  = pd.DataFrame(a, columns=keys)
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [105]:
df.cumsum()

    a   b   c
0   1   2   3
1   5   7   9
2  12  15  18

In [106]:
df.cumprod()

    a   b    c
0   1   2    3
1   4  10   18
2  28  80  162

In [104]:
df - 1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8